Revit 2026 API

# WireAreVertexPointsValid Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AreVertexPointsValid(
	IList<XYZ> vertexPoints,
	Connector startConnector,
	Connector endConnector
)
```
```vb
Public Shared Function AreVertexPointsValid (
	vertexPoints As IList(Of XYZ),
	startConnector As Connector,
	endConnector As Connector
) As Boolean
```
```cpp
public:
static bool AreVertexPointsValid(
	IList<XYZ^>^ vertexPoints,
	Connector^ startConnector,
	Connector^ endConnector
)
```
```fsharp
static member AreVertexPointsValid :
        vertexPoints : IList<XYZ> *
        startConnector : Connector *
        endConnector : Connector -> bool
```

#### Parameters

vertexPoints IListXYZ

startConnector Connector

endConnector Connector

#### Return Value

Boolean

#### Reference

Wire Class

Autodesk.Revit.DB.Electrical Namespace